{
  "retrieved_examples": [
    "2404.15806v1",
    "2601.03570v1",
    "2601.05110v1",
    "2601.05144v1",
    "2601.06411v1",
    "2601.06953v2",
    "2601.07033v1",
    "2601.07055v1",
    "2601.09259v1",
    "2601.09708v1"
  ],
  "initial_description": "Here is a detailed description of the illustrative figure for the AGP pipeline:\n\n**Figure Title:** AGP End-to-End Architecture\n\n**1. Overall Layout:**\nThe figure presents a comprehensive, left-to-right flowing architecture diagram, organized into four distinct horizontal \"tiers\" or \"lanes.\" Each tier is clearly labeled on its left side, indicating different stages of the processing pipeline. The entire figure is set against a pure white background, ensuring a clean and professional aesthetic suitable for publication. A concise legend explaining the color coding and component types will be positioned in the top-right corner.\n\n**2. Tier 1: \"Raw Data\"**\n*   **Label:** On the far left, a prominent, bold label \"Raw Data\" in dark grey text.\n*   **Component: Input Reads:** A rectangular block with slightly rounded corners, filled with a very light grey (e.g., `whisper grey`). It contains the label \"Ancient DNA Reads (FASTQ/FASTA, gzip)\" in dark grey, regular font. A small, minimalist icon depicting stacked documents or a simple DNA helix could be subtly integrated within or next to this block.\n*   **Connection:** A solid, medium-thickness (e.g., 2pt) dark grey arrow points from the \"Ancient DNA Reads\" block to the \"agp predict\" module in Tier 2.\n\n**3. Tier 2: \"Core AGP\"**\n*   **Label:** On the far left, a prominent, bold label \"Core AGP\" in dark grey text.\n*   **Module: `agp predict`:** A large, central rectangular module with moderately rounded corners, filled with a soft, muted teal (e.g., `seafoam green`). Its border is",
  "optimized_description": "**Figure Title:** AGP End-to-End Architecture\n\n**1. Overall Layout:**\nThe figure presents a comprehensive, left-to-right flowing architecture diagram, organized into four distinct horizontal \"tiers\" or \"lanes.\" Each tier is clearly labeled on its left side, indicating different stages of the processing pipeline. A concise legend explaining the color coding and component types will be positioned in the top-right corner.\n\n**2. Tier 1: \"Raw Data\"**\n*   **Label:** On the far left, a prominent, bold label \"Raw Data\" in dark grey sans-serif text.\n*   **Component: Input Reads:** A rounded rectangle with a very soft, pale grey fill and a subtle, slightly darker grey border. It contains the label \"Ancient DNA"
}