{
  "retrieved_examples": [
    "2404.15806v1",
    "2601.03570v1",
    "2601.05110v1",
    "2601.05144v1",
    "2601.06411v1",
    "2601.06953v2",
    "2601.07033v1",
    "2601.07055v1",
    "2601.09259v1",
    "2601.09708v1"
  ],
  "initial_description": "Here is a detailed description of the AGP architecture figure:\n\n**Overall Layout:**\nThe figure presents a clear, landscape-oriented, modular pipeline diagram with a primary data flow from left to right. It is organized into four distinct horizontal tiers, each labeled on the left side, representing different stages of processing. The background is pure white, ensuring a clean, publication-ready aesthetic.\n\n**Tiers and Their Contents (from top to bottom):**\n\n1.  **Raw Data:** This top tier houses the initial input data.\n2.  **Core AGP:** The second tier contains the primary AGP prediction module and its immediate outputs.\n3.  **Search/Index:** The third tier focuses on external search and the conversion to columnar index format.\n4.  **Downstream Inference:** The bottom tier illustrates the final damage annotation and various summary outputs, along with other analytical branches.\n\n**Components and Connections (Main Workflow - Left to Right):**\n\n*   **Input (Tier 1 - Left):**\n    *   A rectangular box with slightly rounded corners, representing a document icon, labeled \"ancient DNA reads (FASTQ/FASTA, often gzip)\". The box has a very light gray fill and a thin dark gray border.\n    *   A solid, medium-thickness (e.g., 2pt) dark gray arrow points from this input box to the \"agp predict\" module.\n\n*   **Module: `agp predict` (Tier 2 - Central):**\n    *   A prominent rectangular module with slightly rounded corners, filled with a \"cornflower blue\" color. The text label \"agp predict\" is in white, and the module has a dark blue border.\n    *   **Internal Sub-blocks:** Inside the \"agp predict\" module, there are two smaller, horizontally stacked sub-blocks with dashed light gray borders and a very faint pale gray fill.\n        *   Top sub-block: \"Damage modeling / calibration (C->T and G->A deamination)\".\n        *   Bottom sub-block: \"Gene prediction + translation\".\n    *   **Outputs:** Three solid, medium-thickness dark gray arrows emerge from the right side of \"agp predict\", each pointing to a distinct data artifact.\n\n*   **Artifacts from `agp predict` (Tier 2 - Right):**\n    *   Three rounded rectangular boxes, vertically stacked, each filled with a \"very light beige\" color and having a thin dark gray border.\n        *   Top: \"predictions.gff\" (gene calls).\n        *   Middle: \"proteins.faa / search.faa\" (translated proteins).\n        *   Bottom: \"predictions.agd\" (per-read damage index).\n    *   A solid, medium-thickness dark gray arrow connects \"proteins.faa / search.faa\" to the \"external protein search (MMseqs2)\" module in Tier 3.\n    *   A dashed, medium-thickness dark gray arrow connects \"predictions.agd\" downwards to the \"agp hits2emi\" module in Tier 3 (indicating optional input).\n    *   Another dashed, medium-thickness dark gray arrow connects \"predictions.agd\" downwards to the \"agp damage-annotate\" module in Tier 4 (indicating optional input for synonymous site metadata).\n\n*   **Module: `external protein search (MMseqs2)` (Tier 3 - Left-Central):**\n    *   A rectangular module with slightly rounded corners, filled with a \"seafoam green\" color. The text label \"external protein search (MMseqs2)\" is in white, and the module has a dark green border.\n    *   Input: A solid, medium-thickness dark gray arrow from \"proteins.faa / search.faa\".\n    *   Output: A solid, medium-thickness dark gray arrow points from this module to the \"hits.tsv\" artifact.\n\n*   **Artifact: `hits.tsv` (Tier 3 - Central):**\n    *   A rounded rectangular box, filled with \"very light beige\" and a thin dark gray border, labeled \"hits.tsv\".\n    *   Output: A solid, medium-thickness dark gray arrow points from \"hits.tsv\" to the \"agp hits2emi\" module.\n\n*   **Module: `agp hits2emi` (Tier 3 - Right-Central):**\n    *   A rectangular module with slightly rounded corners, filled with \"cornflower blue\" with white text \"agp hits2emi\" and a dark blue border.\n    *   Inputs: A solid, medium-thickness dark gray arrow from \"hits.tsv\" and a dashed, medium-thickness dark gray arrow from \"predictions.agd\".\n    *   **Callout:** A small, light yellow speech bubble icon or box labeled \"columnar EMI\" is placed subtly near",
  "optimized_description": "The figure presents a clear, landscape-oriented, modular pipeline diagram with a primary data flow from left to right. It is organized into four distinct horizontal tiers, each labeled on the left side, representing different stages of processing. The background is clean white, ensuring a professional, publication-ready aesthetic.\n\n**Overall Layout and Tier Labels:**\nThe four horizontal tiers are clearly delineated. From top to bottom, they are labeled in bold sans-serif text: \"Raw Data\", \"Core AGP\", \"Search/Index\", and \"Downstream Inference\".\n\n**Components and Connections (Main Workflow - Left to Right):**\n\n*   **Input (Tier 1 - Left):**\n    *   A rounded rectangular box, subtly overlaid with a document icon, filled with a very light, almost"
}